CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2003-01-01','元日'),
('2003-01-13','成人の日'),
('2003-02-11','建国記念の日'),
('2003-03-21','春分の日'),
('2003-04-29','みどりの日'),
('2003-05-03','憲法記念日'),
('2003-05-05','こどもの日'),
('2003-07-21','海の日'),
('2003-09-15','敬老の日'),
('2003-09-23','秋分の日'),
('2003-10-13','体育の日'),
('2003-11-03','文化の日'),
('2003-11-23','勤労感謝の日'),
('2003-11-24','振替休日'),
('2003-12-23','天皇誕生日');
