CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2006-01-01','元日'),
('2006-01-02','振替休日'),
('2006-01-09','成人の日'),
('2006-02-11','建国記念の日'),
('2006-03-21','春分の日'),
('2006-04-29','みどりの日'),
('2006-05-03','憲法記念日'),
('2006-05-04','国民の休日'),
('2006-05-05','こどもの日'),
('2006-07-17','海の日'),
('2006-09-18','敬老の日'),
('2006-09-23','秋分の日'),
('2006-10-09','体育の日'),
('2006-11-03','文化の日'),
('2006-11-23','勤労感謝の日'),
('2006-12-23','天皇誕生日');
