CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2027-01-01','元日'),
('2027-01-11','成人の日'),
('2027-02-11','建国記念の日'),
('2027-02-23','天皇誕生日'),
('2027-03-21','春分の日(未確定)'),
('2027-03-22','振替休日'),
('2027-04-29','昭和の日'),
('2027-05-03','憲法記念日'),
('2027-05-04','みどりの日'),
('2027-05-05','こどもの日'),
('2027-07-19','海の日'),
('2027-08-11','山の日'),
('2027-09-20','敬老の日'),
('2027-09-23','秋分の日(未確定)'),
('2027-10-11','体育の日'),
('2027-11-03','文化の日'),
('2027-11-23','勤労感謝の日');
