CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2028-01-01','元日'),
('2028-01-10','成人の日'),
('2028-02-11','建国記念の日'),
('2028-02-23','天皇誕生日'),
('2028-03-20','春分の日(未確定)'),
('2028-04-29','昭和の日'),
('2028-05-03','憲法記念日'),
('2028-05-04','みどりの日'),
('2028-05-05','こどもの日'),
('2028-07-17','海の日'),
('2028-08-11','山の日'),
('2028-09-18','敬老の日'),
('2028-09-22','秋分の日(未確定)'),
('2028-10-09','スポーツの日'),
('2028-11-03','文化の日'),
('2028-11-23','勤労感謝の日');
