CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2033-01-01','元日'),
('2033-01-10','成人の日'),
('2033-02-11','建国記念の日'),
('2033-03-21','振替休日'),
('2033-04-29','昭和の日'),
('2033-05-03','憲法記念日'),
('2033-05-04','みどりの日'),
('2033-05-05','こどもの日'),
('2033-07-18','海の日'),
('2033-08-11','山の日'),
('2033-09-19','敬老の日'),
('2033-10-10','体育の日'),
('2033-11-03','文化の日'),
('2033-11-23','勤労感謝の日'),
('2033-12-23','天皇誕生日');
