CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2040-01-01','元日'),
('2040-01-02','振替休日'),
('2040-01-09','成人の日'),
('2040-02-11','建国記念の日'),
('2040-02-23','天皇誕生日'),
('2040-04-29','昭和の日'),
('2040-04-30','振替休日'),
('2040-05-03','憲法記念日'),
('2040-05-04','みどりの日'),
('2040-05-05','こどもの日'),
('2040-07-16','海の日'),
('2040-08-11','山の日'),
('2040-09-17','敬老の日'),
('2040-10-08','体育の日'),
('2040-11-03','文化の日'),
('2040-11-23','勤労感謝の日'),
('2040-12-24','振替休日');
