CREATE TABLE IF NOT EXISTS `holiday` (`date` date NOT NULL, `description` text, PRIMARY KEY (date));
REPLACE INTO `holiday` (`date`,`description`) VALUES 
('2041-01-01','元日'),
('2041-01-14','成人の日'),
('2041-02-11','建国記念の日'),
('2041-04-29','昭和の日'),
('2041-05-03','憲法記念日'),
('2041-05-04','みどりの日'),
('2041-05-05','こどもの日'),
('2041-05-06','振替休日'),
('2041-07-15','海の日'),
('2041-08-11','山の日'),
('2041-08-12','振替休日'),
('2041-09-16','敬老の日'),
('2041-10-14','体育の日'),
('2041-11-03','文化の日'),
('2041-11-04','振替休日'),
('2041-11-23','勤労感謝の日'),
('2041-12-23','天皇誕生日');
